---
kind: type
id: T:Autodesk.Revit.DB.Visual.CeramicBumpType
source: html/1ad9af61-0201-e6c6-86ec-37311996d7e0.htm
---
# Autodesk.Revit.DB.Visual.CeramicBumpType

The enumerated type representing the permitted values for the asset property "CeramicBump" from the "Ceramic" schema.

## Syntax (C#)
```csharp
public enum CeramicBumpType
```